---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyDistance
source: html/02c4fc59-2564-a878-154e-4835a653e272.htm
---
# AssetPropertyDistance Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.